% 初级图像处理，输入输出均是图像
% 中级图像处理，输入图像，输出是图像中提取的属性特征
% 高级图像处理，输入图像，输出图像的分析

% 图像分割就是输出图像中提取的属性特征
% 分割图像为其组成区域或者对象，细分的程度取决于要解决的问题
% 非平凡图像的分割是图像处理中最困难的任务之一
% 分割的精度决定了计算机化的分析最终能否成功，考虑稳定分割的可能性

% 单色图像的分割算法，通常基于图像亮度值两个特性：不连续性和相似性
% 1、不连续性，基于亮度的突变来分割图像，例如图像中的边缘
% 2、相似性，主要是根据事先定义的准则把图像分割成相似的区域

% 点、线、边缘检测
% edge 函数边缘检测
% Sobel 边缘检测器
% Prewitt 边缘检测器
% Roberts 边缘检测器
% Laplacian of a Gaussian （LoG）检测器
% 零交叉检测器
% Canny 边缘检测器

% 使用 Hough 变换的线检测
% 使用 Hough 变换做峰值检测
% 使用 Hough 变换做线检测和链接

% 阈值处理
% 全局阈值处理
% 局部阈值处理

% 基于区域的分割
% 区域生长
% 区域分离和合并

% 使用分水岭变换的分割
% 使用距离变换的分水岭
% 使用梯度的分水岭
% 控制标记符的分水岭
% 标记符的选择范围可以从简单过程到涉及尺寸、形状、位置、相对距离、纹理内容等复杂方法


